// Задача 41: Пользователь вводит с клавиатуры M чисел. Посчитайте, сколько чисел больше 0 ввёл пользователь.


// Console.WriteLine("Размер: ");
// int size = int.Parse(Console.ReadLine());
// int[] arr = new int[size];
// int count = 0;



// for (int i = 0; i < arr.Length; i++)   // Заполнение массива
// {
//     Console.WriteLine($"Введите {i}-й элемент");
//     int arrNumber = int.Parse(Console.ReadLine());
//     arr[i] = arrNumber;
// }



// Console.Write("[");   // Вывод массива
// for (int i = 0; i < arr.Length; i++)
// {
//     Console.Write(arr[i] + ", ");
// }
// Console.Write("\b\b]");
// Console.WriteLine();


// for (int i = 0; i < arr.Length; i++)
// {
//     if(arr[i] > 0) count++;
// }
// Console.Write("Элементов больше 0: " + count);